# [
# 
# Script made by CrazyH2 (https://github.com/crazyh2)
# © Copyright 2025 CrazyH2. All rights reserved.
# 
# ]

# Using https://dthung1602.github.io/pyobfusinator/
b='Ḙ̡͉͎͉͎͔̻͎͉͍͔͇̈́͆̀́̈̉ͯ̀̀̀̀͐͒̈̂́̍́̍͂́̓͋͒̚ͅ͏͕͎̲͕͎͎͉͎͇͔͙͉͍̈́̽̀̎̎̎̂̉ͯ̀̀̀̀ͯ̀̀̀̀͒ͯ̀̀̀̀̀̀̀̀͐̚͏̡͔͕͉͕͓͔͔͉͎͔̻͎͉͍͔͇͒̀͒͌͌͂̎͒͑ͯ̀̀̀̀̓͐ͯ̀̀̀̀̀̀̀̀͐͒̈̂́̍́̍͂́̓͋͒͘̚ͅͅͅͅ͏͕͎̦͉͔̈́̽̀́͌̈́̀ͅ͏͉͍̀͐͏͔͕͉͕͓͔͉͔͔͙̝͕͉͕͓͔͕͒̀͒͌͂̎͒͑̂̉ͯ̀̀̀̀̀̀̀̀̈̉ͯ̀̀̀̀̀̀̀̀ͯ̀̀̀̀͒ͯ̀̀̀̀̀̀̀̀͒̀̀͒͌͌͂̎͒͑̎͒͌͘̚ͅͅͅͅͅ͏͎͈͔͔͓͇͉͔͈͕͕͓͐̈̇͐̏̏͒́͗̎͂͒̓̚ͅͅ͏͎͔͎͔̎̓ͅ͏̨̡͍̣͚͙͎͉͍͔͇̏͒́̒̏́̍́̍͂́̓͋͒͏͕͎͓͈͓͍͉͎͖͓͉̈́̏͒͆̏́̈́̏́̏͒ͅͅͅ͏̡͎͓͔͓͔͙͔͉͎͔̻͎͉͍͔͇̏͌́̎͐̇̉ͯ̀̀̀̀̓͐ͯ̀̀̀̀̀̀̀̀͐͒̈̂́̍́̍͂́̓͋͒͘̚ͅͅͅ͏͕͎̦͉͔̈́̽̀́͌̈́̀ͅ͏͔͈͙͔͈̀͆̓̀͐ͅ͏̡͎͕͔͉͔͔͙͔̝͔͉͎͔̻͎͉͍͔͇̀͐̈́́̂̉ͯ̀̀̀̀̀̀̀̀̈̉ͯͯ̀̀̀̀͒ͯ̀̀̀̀̀̀̀̀̀̀͒̎͒́̈́̈̉ͯ̀̀̀̀͐ͯ̀̀̀̀̀̀̀̀͐͒̈̂̍̍͂͋͒͘̚͘̚ͅͅͅͅͅ͏͕͎̦͉͔̈́̽̀́͌̈́̀ͅ͏͓͙͔͈̀͐́͒̀͐ͅ͏͎͕͔͉͔͕͓͔̀͐̈́́̂̉ͯ̀̀̀̀̀̀̀̀̈̉ͯ̀̀̀̀̀̀̀̀ͯ̀̀̀̀̓͘ͅͅ͏͍͇̿͌͏͓̝͕͉͔͉͎͓͕͉͔͉͎͓͎͍͍͉͎̯͍͂́͌̀̀͛ͯ̀̀̀̀̀̀̀̀̂̿̿͂͌̿̿̂̀̿̿͂͌̿̿̌ͯ̀̀̀̀̀̀̀̀̂̿̿́̿̿̂̀̂̿̿̿̿̂̌̀̀̃̀͒̀̀̚̚ͅ͏͒̀́͐͐͒ͅ͏͉͔͍͐͒́̀ͅ͏͕͎͍͉̜͓͔͉͎͇̞̣͎͈͕̈́͌̀́ͯ̀̀̀̀̀̀̀̀̂̿̿͆͌̿̿̂̀̂̓̿͒̂̌̀̃̀́̀͂̀͌͐͆͌̀͆̚͘ͅͅͅͅͅͅͅ͏͕͇͇͉͎͇͇̮͒̀̈́͂ͯ̀̀̀̀̀̀̀̀̂̿̿͐́̓͋́̿̿̂̀̚ͅͅ͏͎̯͔͈͇͎͍͉͉͔͙͔͕͓͔̌̀̃̀͒̀̀͐́̓͋́̀́̀͆̀́͐͐͌̓́͂͌ͯ̀̀̀̀ͯ̀̀̀̀ͯ̀̀̀̀͒ͯ̀̀̀̀̀̀̀̀̈̌̀̚͘͝ͅͅͅͅͅͅͅ͏͍͇̿͌͏͓͕͓͔͂́͌̌̀̓͏͍͇̿͌͏͓͔̥͔͉͂́͌̉ͯ̀̀̀̀̓͐̀̓͐͘͘ͅͅͅ͏̡͎͓͉͎͔̻͎͉͍͔͇̀́̀ͯ̀̀̀̀̀̀̀̀͐͒̈͆̂́̍́̍͂́̓͋͒̚ͅ͏͕͎̦͉͔̈́̽̀́͌̈́̀ͅ͏͕͔͕͔͉͔͉͎͍̝̝͍͉͎̭͉͎̀̓̀͐̈́́̀͛̂̉ͯ̀̀̀̀̀̀̀̀̈̉ͯͯ͆̀̿̿́̿̿̀̀̂̿̿́̿̿̂ͯ̀̀̀̀̈̉͘̚͘̚͝ͅͅͅͅͅͅͅ'.encode();exec(''.join(chr(((h<<6&64|c&63)+22)%133+10)for h,c in zip(b[1::2],b[2::2])))
